IRP/src/AccumulationRegisters/R5022T_Expenses/R5022T_Expenses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R5022T_Expenses</name>
 <registerType>Turnovers</registerType>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountWithTaxes</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountCost</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>CalculationMovementCost</name>
  <type>
   <types>DocumentRef.CalculationMovementCosts</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>FixedAsset</name>
  <type>
   <types>CatalogRef.FixedAssets</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.FixedAssetsLedgerTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AdditionalAnalytic</name>
  <type>
   <types>Characteristic.AddAttributeAndProperty</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R7050T_ProductionDurations/R7050T_ProductionDurations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R7050T_ProductionDurations</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ExpenseTypes/ExpenseTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ExpenseTypes</name>
 <enumValues>
  <name>GeneralExpenses</name>
 </enumValues>
 <enumValues>
  <name>ProductionCosts</name>
 </enumValues>
</mdclass:Enum>

IRP/src/CommonModules/DocProductionCostsAllocationServer/Module.bsl
#Region FormEvents

Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	If Form.Parameters.Key.IsEmpty() Then
		SetGroupItemsList(Object, Form);
		DocumentsClientServer.ChangeTitleGroupTitle(Object, Form);
	EndIf;
	ViewServer_V2.OnCreateAtServer(Object, Form, "ProductionCostsList, ProductionDurationsList");
EndProcedure

Procedure AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters) Export
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	If Not Form.GroupItems.Count() Then
		SetGroupItemsList(Object, Form);
	EndIf;
	DocumentsClientServer.ChangeTitleGroupTitle(CurrentObject, Form);
	LockDataModificationPrivileged.LockFormIfObjectIsLocked(Form, CurrentObject);
EndProcedure

#EndRegion

#Region GroupTitle

Procedure SetGroupItemsList(Object, Form)
	AttributesArray = New Array();
	AttributesArray.Add("Company");
	AttributesArray.Add("BeginDate");
	AttributesArray.Add("EndDate");
	DocumentsServer.DeleteUnavailableTitleItemNames(AttributesArray);
	For Each Attr In AttributesArray Do
		Form.GroupItems.Add(Attr, ?(ValueIsFilled(Form.Items[Attr].Title), Form.Items[Attr].Title,
			Object.Ref.Metadata().Attributes[Attr].Synonym + ":" + Chars.NBSp));
	EndDo;
EndProcedure

#EndRegion

#Region ListFormEvents

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region ChoiceFormEvents

Procedure OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

Function GetCosts(QueryParameters) Export
	Query = New Query();
	Query.Text = 
		"SELECT
		|	R5022T_ExpensesTurnovers.ProfitLossCenter,
		|	R5022T_ExpensesTurnovers.ExpenseType,
		|	R5022T_ExpensesTurnovers.Currency,
		|	R5022T_ExpensesTurnovers.AmountTurnover AS Amount
		|FROM
		|	AccumulationRegister.R5022T_Expenses.Turnovers(BEGINOFPERIOD(&BeginDate, DAY), ENDOFPERIOD(&EndDate, DAY),,
		|		Company = &Company
		|	AND ExpenseType.ExpenseType = VALUE(Enum.ExpenseTypes.ProductionCosts)
		|	AND CurrencyMovementType = &LandedCostCurrency) AS R5022T_ExpensesTurnovers";
			
	Query.SetParameter("Company"   , QueryParameters.Company);
	Query.SetParameter("BeginDate" , QueryParameters.BeginDate);
	Query.SetParameter("EndDate"   , QueryParameters.EndDate);
	LandedCostCurrency = ?(ValueIsFilled(QueryParameters.Company), 
		QueryParameters.Company.LandedCostCurrencyMovementType,
		ChartsOfCharacteristicTypes.CurrencyMovementType.EmptyRef());
	Query.SetParameter("LandedCostCurrency", LandedCostCurrency);

	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
EndFunction

Function GetDurations(QueryParameters) Export
	Query = New Query();
	Query.Text = 
		"SELECT
		|	R7050T_ProductionDurationsTurnovers.BusinessUnit,
		|	R7050T_ProductionDurationsTurnovers.ItemKey.Item AS Item,
		|	R7050T_ProductionDurationsTurnovers.ItemKey,
		|	R7050T_ProductionDurationsTurnovers.DurationTurnover AS Duration
		|FROM
		|	AccumulationRegister.R7050T_ProductionDurations.Turnovers(BEGINOFPERIOD(&BeginDate, DAY), ENDOFPERIOD(&EndDate,
		|		DAY),, Company = &Company) AS R7050T_ProductionDurationsTurnovers";
	
	Query.SetParameter("Company"   , QueryParameters.Company);
	Query.SetParameter("BeginDate" , QueryParameters.BeginDate);
	Query.SetParameter("EndDate"   , QueryParameters.EndDate);

	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
EndFunction
